#include<stdio.h>

int menu();
void origin();
void rule();
void stroy();
void introduce();
void out();
int main()
{

	for(;;)
	switch(menu())
	{
		case 1:origin();break;
		case 2:rule();break;
		case 3:stroy();break;
		case 4:introduce();break;
		case 5:out();break;
	}
	return 0; 
}




int menu()
{ 
	int choice;
	printf("    *-*    *-*    *-*    菜单\n");
    printf("-----------------------------------\n");
    printf("1.围棋的起源。\n");
    printf("2.围棋的博弈规则。\n");
    printf("3.围棋的故事。\n");
    printf("4.围棋的介绍。\n");
    printf("5.退出系统。\n");
    printf("-----------------------------------\n");
	do
	{
		printf("输入你希望执行的选项代码 1,2,3,4,5,6,7\n");
		scanf("%d",&choice);
	}
	while(choice<1||choice>7);
	return choice;
}


void origin()
{
	printf("围棋的起源:\n"); 
	printf("           尧舜以棋教子 琴棋书画，中国古代四大艺术，源远流长。 琴棋书画之棋，\n");
	printf(" 书画之棋，指的就是围棋。 晋朝人张华在他写的《博物志》中说：“尧造围棋以教子\n");
    printf("丹朱。”还提到，舜觉得儿子商均不甚聪慧，也曾制作围棋教子。《路史后记》写得更\n");
    printf("为详细。尧娶妻富宜氏，生下儿子朱，儿子行为不好，尧很难过，特地制作了围棋，“\n");
    printf("以闲其情。” 按照这种说法，制造围棋，是为了开发智慧，纯洁性情的。\n");
    }


void rule()
{
	printf("          规则\n");
	printf("1、 对局双方各执一色棋子。\n");
	printf("2、 空枰开局。\n");
	printf("3、 黑先白后，交替着一子于棋盘的点上。\n");
	printf("4、 棋子下定后，不再向其他点移动。\n");
	printf("5、 轮流下子是双方的权利，但允许任何一方放弃下子权而使用虚着。\n");
	printf("6、 终局时，经双方确认，不能被提取的棋都是活棋。\n");
	printf("7、 终局时，经双方确认，能被提取的棋都是死棋。\n");
	printf("8、 棋局下到双方一致确认着子完毕时，为终局。\n");
	printf("9、 对局中有一方中途认输时，为终局。\n");
	printf("10、 双方连续使用虚着，为终局。\n");
}


void stroy()
{
	printf("       烂柯的传说\n");
	printf("  晋朝时有一位叫王质的人，有一天他到信安郡的石室山（今浙江\n");
	printf("省衢qu县）去打柴。看到一童一叟在溪边大石上正在下围棋，于是\n");
	printf("把砍柴用的斧子放在溪边地上，住足观看。看了多时，童子说?你该\n");
	printf("回家了?，王质起身去拿斧子时，一看斧柄（柯）已经腐朽了，磨得\n");
	printf("锋利的斧头也锈的凸凹不平了。王质非常奇怪。回到家里后，发现家\n");
	printf("乡已经大变样。无人认得他，提起的事，有几位老者，都说是几百年\n");
	printf("前的事了。原来王质石室山打柴误入仙境，遇到了神仙，仙界一日，\n");
	printf("人间百年。\n");
	printf("  后来，后人就把?烂柯?作为围棋的一个别名。\n");
}


void introduce()
{
	
	printf("----围棋用具的介绍---\n");
	printf("1、棋盘\n");
    printf("棋盘由纵横各十九条等距离、垂直交叉的平行线构成。形成361个交叉点，在\n");
    printf("围棋中简称为“点”。棋盘整体形状以及每个格子纵、横向相比，横向稍短，\n");
    printf("通常为每格2.4厘米×2.3厘米。在棋盘上标有九个小圆点，称作“星”。中央\n");
    printf("的圆点又称“天元”。\n");
    printf("2、棋子\n");
    printf("棋子分黑白两色，形状为扁圆形体。棋子的数量应能保证顺利终局。正式比赛\n");
    printf("以黑181、白180子为宜。\n");
    printf("3、棋子的气\n");
    printf("一个棋子在棋盘上，与它直线紧邻的空点是这个棋子的“气”。直线紧邻的点\n");
    printf("上如果有同色棋子存在，这些棋子就相互连接成一个不可分割的整体。直线紧\n");
    printf("邻的点上如果有异色棋子存在，此处的气便不存在。棋子如失去所有的气，就\n");
    printf("不能在棋盘上存在。\n");
    printf("4、禁着点\n");
    printf("棋盘上的任何一点，如某方下子后，该子立即呈无气状态，同时又不能提取对\n");
    printf("提取对方的棋子\n");
}



void out()

{
	printf("The end\n");
}
